tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Dependency Manager for PHP
brew "composer"
# Modern replacement for 'ls'
brew "exa"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
cask "1password"
cask "alfred3"
cask "android-studio"
cask "charles"
cask "daisydisk"
cask "dash"
cask "deepl"
cask "docker"
cask "fork"
cask "forklift"
cask "go2shell"
cask "google-chrome"
cask "hiddenbar"
cask "hyperswitch"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "kitematic"
cask "manico"
cask "neteasemusic"
cask "notion"
cask "paw"
cask "pdf-expert"
cask "sequel-pro"
cask "spectacle"
cask "surge"
cask "telegram"
cask "visual-studio-code"
cask "vmware-fusion"
cask "webstorm"
cask "wormhole"
mas "Amphetamine", id: 937984704
mas "Helium", id: 1054607607
mas "Manico", id: 724472954
mas "Microsoft Remote Desktop", id: 1295203466
mas "Reeder", id: 1449412482
mas "Xcode", id: 497799835
mas "微信", id: 836500024
